In [2]:
import pandas as pd
df = pd.read_csv("city_temperature.csv")

In [4]:
df.head(5)

   Region  Country State     City  Month  Day    Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995.0            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995.0            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995.0            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995.0            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995.0            47.9

In [16]:
df.head(5)

   Region  Country State     City  Month  Day    Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995.0            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995.0            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995.0            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995.0            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995.0            47.9

In [9]:
df.corr()

                   Month       Day      Year  AvgTemperature
Month           1.000000  0.011248 -0.028809        0.058923
Day             0.011248  1.000000 -0.002324       -0.000773
Year           -0.028809 -0.002324  1.000000        0.091687
AvgTemperature  0.058923 -0.000773  0.091687        1.000000

In [11]:
df.dtypes

Region             object
Country            object
State              object
City               object
Month               int64
Day                 int64
Year              float64
AvgTemperature    float64
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2211112 entries, 0 to 2211111
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   Region          object
 1   Country         object
 2   State           object
 3   City            object
 4   Month           int64
 5   Day             int64
 6   Year            float64
 7   AvgTemperature  float64
dtypes: float64(2), int64(2), object(4)
memory usage: 135.0+ MB

In [13]:
df.columns

Index(['Region', 'Country', 'State', 'City', 'Month', 'Day', 'Year',
       'AvgTemperature'],
      dtype='object')

In [14]:
 df.describe()

              Month           Day          Year  AvgTemperature
count  2.211112e+06  2.211112e+06  2.211111e+06    2.211111e+06
mean   6.469587e+00  1.571703e+01  2.006458e+03    5.606860e+01
std    3.456504e+00  8.800629e+00  2.649057e+01    3.496300e+01
min    1.000000e+00  0.000000e+00  2.000000e+02   -9.900000e+01
25%    3.000000e+00  8.000000e+00  2.001000e+03    4.720000e+01
50%    6.000000e+00  1.600000e+01  2.007000e+03    6.390000e+01
75%    9.000000e+00  2.300000e+01  2.013000e+03    7.680000e+01
max    1.200000e+01  3.100000e+01  2.020000e+03    1.100000e+02

In [19]:
df.loc[df['AvgTemperature'].idxmax()]

Region            Middle East
Country                Kuwait
State                     NaN
City                   Kuwait
Month                       8
Day                         1
Year                     2012
AvgTemperature            110
Name: 1034962, dtype: object

In [18]:
df.Country.unique()

array(['Algeria', 'Burundi', 'Benin', 'Central African Republic', 'Congo',
       'Egypt', 'Ethiopia', 'Gabon', 'Gambia', 'Guinea', 'Guinea-Bissau',
       'Ivory Coast', 'Kenya', 'Morocco', 'Madagascar', 'Mauritania',
       'Malawi', 'Mozambique', 'Namibia', 'Nigeria', 'Senegal',
       'Sierra Leone', 'South Africa', 'Togo', 'Tunisia', 'Tanzania',
       'Uganda', 'Zambia', 'Bangladesh', 'China', 'Hong Kong', 'India',
       'Indonesia', 'Japan', 'Kazakhstan', 'Kyrgyzstan', 'Laos',
       'Malaysia', 'Mongolia', 'Myanmar (Burma)', 'Nepal', 'North Korea',
       'Pakistan', 'Philippines', 'Singapore', 'South Korea', 'Sri Lanka',
       'Taiwan', 'Tajikistan', 'Thailand', 'Turkmenistan', 'Uzbekistan',
       'Vietnam', 'Australia', 'New Zealand', 'Albania', 'Austria',
       'Belarus', 'Belgium', 'Bulgaria', 'Croatia', 'Cyprus',
       'Czech Republic', 'Denmark', 'Finland', 'France', 'Germany',
       'Georgia', 'Greece', 'Hungary', 'Iceland', 'Ireland', 'Italy',
       'Latvia', 'Macedonia', 'The Netherlands', 'Norway', 'Poland',
       'Portugal', 'Romania', 'Russia', 'Serbia-Montenegro', 'Slovakia',
       'Spain', 'Sweden', 'Switzerland', 'Ukraine', 'United Kingdom',
       'Yugoslavia', 'Bahrain', 'Israel', 'Jordan', 'Kuwait', 'Lebanon',
       'Oman', 'Qatar', 'Saudi Arabia', 'Syria', 'Turkey',
       'United Arab Emirates', 'Canada', 'Mexico', 'Argentina', 'Bahamas',
       'Bermuda', 'Belize', 'Bolivia', 'Barbados', 'Brazil', 'Colombia',
       'Costa Rica', 'Cuba', 'Dominican Republic', 'Equador', 'Guatemala',
       'Guyana', 'Haiti', 'Honduras', 'Nicaragua', 'Panama', 'Peru',
       'Suriname', 'Uruguay', 'Venezuela', 'US'], dtype=object)

In [21]:
df.Country.value_counts()

US                   760122
Canada                74245
Australia             46330
China                 46329
India                 37063
                      ...
Guyana                 5065
Israel                 4641
Burundi                4543
Georgia                4378
Serbia-Montenegro      3427
Name: Country, Length: 125, dtype: int64